## Creating, Saving, and Loading a Pandas DataFrame in Multiple Formats (CSV, JSON, Excel)

In [1]:
# Pandas is format-independent — as long as data can be structured like a table, Pandas can read it.
# Create DataFrame manually from a dictionary
# Save DataFrame to CSV, JSON, Excel
# Load DataFrame from CSV, JSON, Excel

# Step 1: Imorting pandas

In [14]:
import pandas as pd

# Step 2: Creating a Dictionary

In [5]:
# Create DataFrame manually from a dictionary
data={
    'Name': ['Asma','Manha','Ayman','Jaffer'],
    'Age': [38,6,10,40],
    'City': ['Kgm','Hyd','NK Nagar','Mancherial']
}
data

{'Name': ['Asma', 'Manha', 'Ayman', 'Jaffer'],
 'Age': [38, 6, 10, 40],
 'City': ['Kgm', 'Hyd', 'NK Nagar', 'Mancherial']}

In [12]:
# column names as keys (Name, Age, City)
# rows as list values. df are table like structure, 2D
# This is like creating a table manually inside Python.
#convert this dictionary into df

# Step 3: Convert Dictionary → DataFrame

In [16]:
df=pd.DataFrame(data)
df
# Pandas directly converts dictionary → table.

     Name  Age        City
0    Asma   38         Kgm
1   Manha    6         Hyd
2   Ayman   10    NK Nagar
3  Jaffer   40  Mancherial

In [13]:
# Now df is a DataFrame (2D table)

## Step 4: Saving a DataFrame into different formats

## df into csv format

In [17]:
df.to_csv("people.csv",index=False)

# Saves the table as a CSV file.
# index=False means don't add row numbers in the file.

In [22]:
#df.to_excel("people.xlsx", index=False)

In [25]:
df.to_json("people.json", orient="records")
# Saves the data as JSON format.
# orient="records" means store each row as a separate JSON object.

## Step 5: Load These Files Back Into Pandas

In [28]:
df_csv=pd.read_csv("people.csv")
df_json=pd.read_json("people.json")
#df_excel=pd.read_excel("people.xlsx")

In [29]:
#Now Pandas reads each file type and converts it back into DataFrames, we gave new names to df.

In [30]:
df_json

     Name  Age        City
0    Asma   38         Kgm
1   Manha    6         Hyd
2   Ayman   10    NK Nagar
3  Jaffer   40  Mancherial

In [31]:
df_csv
# df_csv- Meaning: Show the DataFrame. This gives o/p in the form of a TABLE.

     Name  Age        City
0    Asma   38         Kgm
1   Manha    6         Hyd
2   Ayman   10    NK Nagar
3  Jaffer   40  Mancherial

In [32]:
print(df_csv)
# If we use print statement,Meaning:Print the DataFrame text. This gives o/p in the form of a plain TEXT.

     Name  Age        City
0    Asma   38         Kgm
1   Manha    6         Hyd
2   Ayman   10    NK Nagar
3  Jaffer   40  Mancherial

In [33]:
#df_csv is a DataFrame object stored in memory. That's why you can call methods on it like:
# df_csv.head()
# df_csv.info()
# df_csv.shape
# df_csv.describe()